---
type: FamilyInstancePlacingArgs
namespace: Autodesk.Revit.UI
version: 2024
members: 6
tags: [revit-api, class]
---

# FamilyInstancePlacingArgs

`Autodesk.Revit.UI.FamilyInstancePlacingArgs` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Property | ActiveView | 2017 | `public View ActiveView { get ; internal set ; }` |
| Property | IsBanned | 2017 | `public bool IsBanned { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | StatusMessage | 2017 | `public string StatusMessage { get ; set ; }` |
| Property | TooltipMessage | 2017 | `public string TooltipMessage { get ; set ; }` |